In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
ts1 = pd.read_csv(r"Data/TS1.csv", encoding='unicode_escape')
ts2 = pd.read_csv(r"Data/TS2.csv", encoding='unicode_escape')
ts8 = pd.read_csv(r"Data/TS8.csv", encoding='unicode_escape', on_bad_lines='skip', low_memory=False)

## Data Cleaning

In [5]:
ts1.head()

,Rep,Cust,Customer Name,Group,Part Number,Description,Doc,Line,Date,Time,Qty,Unit,Disc%,Cost,Range
0,2,193750,ROCK AUTO LLC,ACC,ACC31019,LITERIDER 73-96 F-Series,01V4661208,1,Nov 07 22,08:22,1,308.74,NaN,262.33,0028
1,2,193750,ROCK AUTO LLC,ACC,ACC31029,LITERIDER 73-96 F-Series,01V4786521,2,Jan 04 23,16:33,1,296.23,NaN,248.63,0028
2,2,193750,ROCK AUTO LLC,ACC,ACC31109,LITERIDER 82-11 Ranger &,01V4689424,1,Nov 20 22,15:23,1,283.15,NaN,237.97,0028
3,2,193750,ROCK AUTO LLC,ACC,ACC31109,LITERIDER 82-11 Ranger &,01V4771133,1,Dec 29 22,08:28,1,283.15,NaN,236.97,0028
4,2,193750,ROCK AUTO LLC,ACC,ACC31129,LITERIDER 01-06 Explorer,01V4683310,1,Nov 16 22,15:27,1,283.15,NaN,243.50,0028

In [6]:
ts1.drop(columns=['Rep', 'Cust', 'Customer Name', 'Description', 'Doc', 'Disc%', 'Range'], inplace=True)
ts2.drop(columns=['Rep', 'Cust', 'Customer Name', 'Description', 'Doc', 'Disc%', 'Range'], inplace=True)
ts8.drop(columns=['Rep', 'Cust', 'Customer Name', 'Description', 'Doc', 'Disc%', 'Range'], inplace=True)

In [7]:
df_list = [ts1, ts2, ts8]

for i in df_list:
    print(f'Missing Values: {i.isnull().sum()}')

Missing Values: Group          8
Part Number    0
Line           0
Date           0
Time           0
Qty            0
Unit           0
Cost           0
dtype: int64
Missing Values: Group          1
Part Number    0
Line           0
Date           0
Time           0
Qty            0
Unit           0
Cost           0
dtype: int64
Missing Values: Group           1
Part Number     0
Line            0
Date            0
Time            0
Qty             0
Unit           21
Cost            0
dtype: int64

In [8]:
for i in df_list:
    i.dropna(inplace=True)

In [9]:
df_list = [ts1, ts2, ts8]

for i in df_list:
    print(f'Missing Values: {i.isnull().sum()}')

Missing Values: Group          0
Part Number    0
Line           0
Date           0
Time           0
Qty            0
Unit           0
Cost           0
dtype: int64
Missing Values: Group          0
Part Number    0
Line           0
Date           0
Time           0
Qty            0
Unit           0
Cost           0
dtype: int64
Missing Values: Group          0
Part Number    0
Line           0
Date           0
Time           0
Qty            0
Unit           0
Cost           0
dtype: int64

In [10]:
for i in df_list:
    print(f'Duplicate Values: {i.duplicated().sum()}')

Duplicate Values: 737
Duplicate Values: 639
Duplicate Values: 540

In [11]:
for i in df_list:
    i.drop_duplicates(inplace=True)

In [12]:
for i in df_list:
    print(f'Duplicate Values: {i.duplicated().sum()}')

Duplicate Values: 0
Duplicate Values: 0
Duplicate Values: 0

In [13]:
for i in df_list:
    print(i.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 222302 entries, 0 to 223046
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Group        222302 non-null  object
 1   Part Number  222302 non-null  object
 2   Line         222302 non-null  int64
 3   Date         222302 non-null  object
 4   Time         222302 non-null  object
 5   Qty          222302 non-null  int64
 6   Unit         222302 non-null  float64
 7   Cost         222302 non-null  float64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.3+ MB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 163148 entries, 0 to 163787
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Group        163148 non-null  object
 1   Part Number  163148 non-null  object
 2   Line         163148 non-null  int64
 3   Date         163148 non-null  object
 4   Time         163148 non-null  object
 5   Qty          163148 non-null  int64
 6   Unit         163148 non-null  float64
 7   Cost         163148 non-null  float64
dtypes: float64(2), int64(2), object(4)
memory usage: 11.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 179822 entries, 0 to 180383
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Group        179822 non-null  object
 1   Part Number  179822 non-null  object
 2   Line         179822 non-null  object
 3   Date         179822 non-null  object
 4   Time         179822 non-null  object
 5   Qty          179822 non-null  float64
 6   Unit         179822 non-null  float64
 7   Cost         179822 non-null  object
dtypes: float64(2), object(6)
memory usage: 12.3+ MB
None

In [14]:
for i in df_list:
    i['Date'] = pd.to_datetime(i['Date'])

In [15]:
ts1.head()

  Group Part Number  Line       Date   Time  Qty    Unit    Cost
0   ACC    ACC31019     1 2022-11-07  08:22    1  308.74  262.33
1   ACC    ACC31029     2 2023-01-04  16:33    1  296.23  248.63
2   ACC    ACC31109     1 2022-11-20  15:23    1  283.15  237.97
3   ACC    ACC31109     1 2022-12-29  08:28    1  283.15  236.97
4   ACC    ACC31129     1 2022-11-16  15:27    1  283.15  243.50

In [16]:
ts1.set_index(['Group'], inplace=True)

In [17]:
ts1.head()

      Part Number  Line       Date   Time  Qty    Unit    Cost
Group
ACC      ACC31019     1 2022-11-07  08:22    1  308.74  262.33
ACC      ACC31029     2 2023-01-04  16:33    1  296.23  248.63
ACC      ACC31109     1 2022-11-20  15:23    1  283.15  237.97
ACC      ACC31109     1 2022-12-29  08:28    1  283.15  236.97
ACC      ACC31129     1 2022-11-16  15:27    1  283.15  243.50

In [ ]:
skp_ts1 = ts1.loc['SKP'].sum()
display(skp_ts1)

Group,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP,...,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP,SKP
Part Number,SKPS31129063163,SKPS31129063163,SKPS32106774318,SKPS32106774318,SKPS32106774318,SKPS32106774319,SKPS32106774319,SKPS32106774319,SKPSCK620061,SKPSCK620062,...,SKPSS10609,SKPSS10609,SKPSS10609,SKPSS10609,SKPSS10610,SKPSS10610,SKPSS10610,SKPSS10610,SKPSS251073,SKPSS251073
Line,2,1,1,2,1,2,2,1,2,20,...,2,2,3,2,1,1,2,1,1,2
Date,2022-11-21 00:00:00,2022-12-11 00:00:00,2022-11-22 00:00:00,2023-01-10 00:00:00,2023-01-10 00:00:00,2022-11-22 00:00:00,2023-01-09 00:00:00,2023-01-10 00:00:00,2023-01-08 00:00:00,2022-11-16 00:00:00,...,2022-11-30 00:00:00,2022-12-21 00:00:00,2023-01-15 00:00:00,2023-01-29 00:00:00,2022-11-01 00:00:00,2022-11-30 00:00:00,2023-01-15 00:00:00,2023-01-29 00:00:00,2022-11-08 00:00:00,2022-11-10 00:00:00
Time,09:07,19:50,08:08,08:22,08:50,08:08,16:28,08:22,18:50,15:29,...,16:12,08:24,20:08,15:37,08:16,16:12,20:08,15:37,12:01,08:36
Qty,1,1,1,1,1,1,1,1,1,2,...,1,1,1,1,1,1,1,1,-1,1

In [20]:
def plot_results(data1, data2, data3):
    with plt.style.context(['seaborn-muted', 'dark_background']):
        fig, ax = plt.subplots(3,1,figsize=(20,15))
        sns.lineplot(data=data1, x='Date', y='Cost', ax=ax[0])
        sns.lineplot(data=data2, x='Date', y='Cost', ax=ax[1])
        sns.lineplot(data=data3, x='Date', y='Cost', ax=ax[2])

In [22]:
plot_results(ts1)